; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 200394 2 1 4 6 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image1 - mode
	infrared0 - mode
	infrared3 - mode
	image2 - mode
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	Star4 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument1 infrared0)
	(supports instrument1 infrared3)
	(supports instrument1 image2)
	(calibration_target instrument1 Star4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
)
(:goal (and
	(pointing satellite0 Phenomenon11)
	(pointing satellite1 Star7)
	(have_image Star6 image2)
	(have_image Star7 infrared3)
	(have_image Star8 infrared0)
	(have_image Planet9 image2)
	(have_image Planet10 image1)
	(have_image Phenomenon11 image1)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (turn_to satellite0 star7 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star7)
   goals met: 0 of 8
4. (turn_to satellite1 star4 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star4)
   goals met: 0 of 8
5. (turn_to satellite0 planet10 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet10)
   goals met: 0 of 8
6. (calibrate satellite1 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 8
7. (turn_to satellite1 star8 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star8)
   goals met: 0 of 8
8. (turn_to satellite0 phenomenon11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon11)
   goals met: 1 of 8
9. (take_image satellite1 star8 instrument1 infrared0)
   added: (have_image star8 infrared0)
   goals met: 2 of 8
10. (turn_to satellite0 groundstation0 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation0)
   goals met: 1 of 8
11. (turn_to satellite1 star7 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star7)
   goals met: 2 of 8
12. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 2 of 8
13. (take_image satellite1 star7 instrument1 infrared3)
   added: (have_image star7 infrared3)
   goals met: 3 of 8
14. (turn_to satellite0 planet10 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet10)
   goals met: 3 of 8
15. (take_image satellite0 planet10 instrument0 image1)
   added: (have_image planet10 image1)
   goals met: 4 of 8
16. (turn_to satellite1 planet9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet9)
   goals met: 3 of 8
17. (turn_to satellite0 phenomenon11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 8
18. (take_image satellite1 planet9 instrument1 image2)
   added: (have_image planet9 image2)
   goals met: 5 of 8
19. (take_image satellite0 phenomenon11 instrument0 image1)
   added: (have_image phenomenon11 image1)
   goals met: 6 of 8
20. (turn_to satellite1 star7 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star7)
   goals met: 7 of 8
21. (turn_to satellite1 star6 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star6)
   goals met: 6 of 8
22. (take_image satellite1 star6 instrument1 image2)
   added: (have_image star6 image2)
   goals met: 7 of 8
23. (turn_to satellite1 star7 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star7)
   goals met: 8 of 8
